# С начала суток прошло n минут.  Определите, сколько часов и минут будут показывать электронные часы в этот момент.
# Программа должна вывести два числа: количество часов (от 0 до 23) и количество минут (от 0 до 59). Учтите, что число n может быть больше, чем количество минут в сутках.
 

# Входные данные
# Вводится целое число n.

# Выходные данные 
# Выведите ответ на задачу.

 
# Запрещено использовать какие-либо алгоритмические конструкции, кроме арифметических операций. Список запрещенных операций смотри в в строке запрещенные операторы.
 
# Примеры
# №	Входные данные	Выходные данные
# 1	    150	            2 30
# 2	    1441	        0 1
# Запрещенные операторы: i f; f o r; w h i l e; d o; m a x