# В некоторой школе занятия начинаются в 9:00. Продолжительность урока — 45 минут, после 1-го, 3-го, 5-го и т.д. уроков перемена 5 минут, а после 2-го, 4-го, 6-го и т.д. — 15 минут. Определите, когда заканчивается указанный урок.
 

# Входные данные
# Дан номер урока (число от 1 до 10).

# Выходные данные
# Выведите два целых числа: время окончания урока в часах и минутах. При решении этой задачи нельзя пользоваться циклами и условными инструкциями.
 
# Запрещено использовать какие-либо алгоритмические конструкции, кроме арифметических операций. Список запрещенных операций смотри в в строке запрещенные операторы.
 
# Примеры
# №	Входные данные	Выходные данные
# 1     3	        11 35
# 2	    2	        10 35
# Запрещенные операторы: i f; wh ile; fo r; vopros; un til

n = int(input())

